
<img src="../../img/ods_stickers.jpg">

## <center> [mlcourse.ai](https://mlcourse.ai) – открытый курс OpenDataScience по машинному обучению 

Автор материала: Юрий Кашницкий (@yorko в Slack ODS). Материал распространяется на условиях лицензии [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/). Можно использовать в любых целях (редактировать, поправлять и брать за основу), кроме коммерческих, но с обязательным упоминанием автора материала.

# <center>Домашнее задание № 1 (демо).<br> Анализ данных по доходу населения UCI Adult</center>

**В задании предлагается с помощью Pandas ответить на несколько вопросов по данным репозитория UCI [Adult](https://archive.ics.uci.edu/ml/datasets/Adult) (качать данные не надо – они уже есть в репозитории). Для отправки решений используйте [онлайн-форму](https://docs.google.com/forms/d/1xAzU-5N6oEeR4UG8G44V6XL-Kbr4WYcPBG45Kijge2Y).**

Уникальные значения признаков (больше информации по ссылке выше):
- age: continuous.
- workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
- fnlwgt: continuous.
- education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
- education-num: continuous.
- marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
- occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
- relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
- race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
- sex: Female, Male.
- capital-gain: continuous.
- capital-loss: continuous.
- hours-per-week: continuous.
- native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.   
- salary: >50K,<=50K

Решение: https://colab.research.google.com/drive/1SFqFljPUX-cXCUbCEJlavxHehhZKccUU?usp=drive_open

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("../../data/adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [7]:
data.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
salary            0
dtype: int64

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

**1. Сколько мужчин и женщин (признак *sex*) представлено в этом наборе данных?**

In [6]:
# Ваш код здесь
data.groupby(['sex'], dropna=False)['sex'].count()

sex
Female    10771
Male      21790
Name: sex, dtype: int64

**2. Каков средний возраст (признак *age*) женщин?**

In [13]:
# Ваш код здесь
data[data['sex']=='Female']['age'].mean().round(2)

36.86

**3. Какова доля граждан Германии (признак *native-country*)?**

In [18]:
# Ваш код здесь
data['native-country'].value_counts(normalize=True)

native-country
United-States                 8.96e-01
Mexico                        1.97e-02
?                             1.79e-02
Philippines                   6.08e-03
Germany                       4.21e-03
Canada                        3.72e-03
Puerto-Rico                   3.50e-03
El-Salvador                   3.26e-03
India                         3.07e-03
Cuba                          2.92e-03
England                       2.76e-03
Jamaica                       2.49e-03
South                         2.46e-03
China                         2.30e-03
Italy                         2.24e-03
Dominican-Republic            2.15e-03
Vietnam                       2.06e-03
Guatemala                     1.97e-03
Japan                         1.90e-03
Poland                        1.84e-03
Columbia                      1.81e-03
Taiwan                        1.57e-03
Haiti                         1.35e-03
Iran                          1.32e-03
Portugal                      1.14e-03
Nicaragua                     1.04e-03
Peru                          9.52e-04
France                        8.91e-04
Greece                        8.91e-04
Ecuador                       8.60e-04
Ireland                       7.37e-04
Hong                          6.14e-04
Cambodia                      5.84e-04
Trinadad&Tobago               5.84e-04
Laos                          5.53e-04
Thailand                      5.53e-04
Yugoslavia                    4.91e-04
Outlying-US(Guam-USVI-etc)    4.30e-04
Honduras                      3.99e-04
Hungary                       3.99e-04
Scotland                      3.69e-04
Holand-Netherlands            3.07e-05
Name: proportion, dtype: float64

**4-5. Каковы средние значения и среднеквадратичные отклонения возраста тех, кто получает более 50K в год (признак *salary*) и тех, кто получает менее 50K в год? **

In [20]:
# Ваш код здесь
data.groupby('salary')['age'].agg([np.mean, np.std])

         mean    std
salary
<=50K   36.78  14.02
>50K    44.25  10.52

**6. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? (признак *education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* или *Doctorate*)**

In [9]:
# Ваш код здесь
data.groupby(['salary','education']).agg(cnt=('education', 'count')).sort_values(['salary','cnt'], ascending = False)

                      cnt
salary education
>50K   Bachelors     2221
       HS-grad       1675
       Some-college  1387
       Masters        959
       Prof-school    423
       Assoc-voc      361
       Doctorate      306
       Assoc-acdm     265
       10th            62
       11th            60
       7th-8th         40
       12th            33
       9th             27
       5th-6th         16
       1st-4th          6
<=50K  HS-grad       8826
       Some-college  5904
       Bachelors     3134
       11th          1115
       Assoc-voc     1021
       10th           871
       Assoc-acdm     802
       Masters        764
       7th-8th        606
       9th            487
       12th           400
       5th-6th        317
       1st-4th        162
       Prof-school    153
       Doctorate      107
       Preschool       51

**7. Выведите статистику возраста для каждой расы (признак *race*) и каждого пола. Используйте *groupby* и *describe*. Найдите таким образом максимальный возраст мужчин расы *Amer-Indian-Eskimo*.**

In [10]:
# Ваш код здесь
data.groupby(['sex', 'race'])['age'].describe()

                             count       mean        std   min   25%   50%  \
sex    race
Female Amer-Indian-Eskimo    119.0  37.117647  13.114991  17.0  27.0  36.0
       Asian-Pac-Islander    346.0  35.089595  12.300845  17.0  25.0  33.0
       Black                1555.0  37.854019  12.637197  17.0  28.0  37.0
       Other                 109.0  31.678899  11.631599  17.0  23.0  29.0
       White                8642.0  36.811618  14.329093  17.0  25.0  35.0
Male   Amer-Indian-Eskimo    192.0  37.208333  12.049563  17.0  28.0  35.0
       Asian-Pac-Islander    693.0  39.073593  12.883944  18.0  29.0  37.0
       Black                1569.0  37.682600  12.882612  17.0  27.0  36.0
       Other                 162.0  34.654321  11.355531  17.0  26.0  32.0
       White               19174.0  39.652498  13.436029  17.0  29.0  38.0

                             75%   max
sex    race
Female Amer-Indian-Eskimo  46.00  80.0
       Asian-Pac-Islander  43.75  75.0
       Black               46.00  90.0
       Other               39.00  74.0
       White               46.00  90.0
Male   Amer-Indian-Eskimo  45.00  82.0
       Asian-Pac-Islander  46.00  90.0
       Black               46.00  90.0
       Other               42.00  77.0
       White               49.00  90.0

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак *marital-status*)? Женатыми считаем тех, у кого *marital-status* начинается с *Married* (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [24]:
# Ваш код здесь
data['marital'] = data['marital-status'].apply(lambda x: True if x[:7]=='Married' else False)
data.groupby(['marital','salary'])['marital'].agg('count')

marital  salary
False    <=50K     16039
         >50K       1105
True     <=50K      8681
         >50K       6736
Name: marital, dtype: int64

In [14]:
data.groupby(['marital','marital-status'])['marital-status'].agg('count')

marital  marital-status
False    Divorced                  4443
         Never-married            10683
         Separated                 1025
         Widowed                    993
True     Married-AF-spouse           23
         Married-civ-spouse       14976
         Married-spouse-absent      418
Name: marital-status, dtype: int64

**9. Какое максимальное число часов человек работает в неделю (признак *hours-per-week*)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [4]:
# Ваш код здесь
# data['hours-per-week'].max()
data[data['hours-per-week'] == 99].groupby('salary')['salary'].agg('count')

salary
<=50K    60
>50K     25
Name: salary, dtype: int64

**10. Посчитайте среднее время работы (*hours-per-week*) зарабатывающих мало и много (*salary*) для каждой страны (*native-country*).**

In [27]:
# Ваш код здесь
data[data['native-country']=='Japan'].groupby(['native-country','salary'])['hours-per-week'].agg('mean')

native-country  salary
Japan           <=50K     41.000000
                >50K      47.958333
Name: hours-per-week, dtype: float64